#### Terraform Format and Style 🖋️`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Digital_Training_Log_App/digital-training-log-app-dev/runs/run-j3fQcQMApoE63U3E

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...
aws_cloudfront_origin_access_control.site: Refreshing state... [id=E3VRQ2R2QNXB1G]
aws_route53_zone.primary: Refreshing state... [id=Z0334061T0FIKF4HFSZX]
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:465616206436:certificate/90aac4f1-04e9-4a19-b5ac-f3fb453f87f6]
aws_s3_bucket.static_website: Refreshing state... [id=dev.digitaltraininglog.com]
aws_acm_certificate_validation.example: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_cloudfront_distribution.site: Refreshing state... [id=ERA3IC0CPA7VD]
aws_route53_record.site: Refreshing state... [id=Z0334061T0FIKF4HFSZX_dev.digitaltraininglog.com_A]
aws_s3_bucket_policy.site: Refreshing state... [id=dev.digitaltraininglog.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudfront_oac_access will be read during apply
 <= data "aws_iam_policy_document" "cloudfront_oac_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::dev.digitaltraininglog.com/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::465616206436:distribution/ERA3IC0CPA7VD",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.cert must be replaced
+/- resource "aws_acm_certificate" "cert" {
      ~ arn                       = "arn:aws:acm:us-east-1:465616206436:certificate/90aac4f1-04e9-4a19-b5ac-f3fb453f87f6" -> (known after apply)
      ~ domain_name               = "dev.digitaltraininglog.com" -> "app.digitaltraininglog.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "dev.digitaltraininglog.com"
              - resource_record_name  = "_6ed158719bd05cb5f29ac6b6dd7b8778.dev.digitaltraininglog.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_ea27da072722838f77f581de20a20b83.zfyfvmchrl.acm-validations.aws."
            },
          + {
              + domain_name           = "app.digitaltraininglog.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:465616206436:certificate/90aac4f1-04e9-4a19-b5ac-f3fb453f87f6" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-01-06T23:59:59Z" -> (known after apply)
      ~ not_before                = "2024-12-08T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "dev.digitaltraininglog.com",
          + "app.digitaltraininglog.com",
        ]
        tags                      = {
            "Environment" = "dev"
            "Name"        = "Website-Cert-dev"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.example must be replaced
-/+ resource "aws_acm_certificate_validation" "example" {
      ~ certificate_arn = "arn:aws:acm:us-east-1:465616206436:certificate/90aac4f1-04e9-4a19-b5ac-f3fb453f87f6" -> (known after apply) # forces replacement
      ~ id              = "0001-01-01 00:00:00 +0000 UTC" -> (known after apply)
    }

  # aws_cloudfront_distribution.site will be updated in-place
  ~ resource "aws_cloudfront_distribution" "site" {
      ~ aliases                         = [
          - "dev.digitaltraininglog.com",
          + "app.digitaltraininglog.com",
        ]
        id                              = "ERA3IC0CPA7VD"
        tags                            = {}
        # (21 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:465616206436:certificate/90aac4f1-04e9-4a19-b5ac-f3fb453f87f6" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_route53_record.site must be replaced
-/+ resource "aws_route53_record" "site" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "dev.digitaltraininglog.com" -> (known after apply)
      ~ id                               = "Z0334061T0FIKF4HFSZX_dev.digitaltraininglog.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "dev.digitaltraininglog.com" -> "app.digitaltraininglog.com" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.site will be updated in-place
  ~ resource "aws_s3_bucket_policy" "site" {
        id     = "dev.digitaltraininglog.com"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::465616206436:distribution/ERA3IC0CPA7VD"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::dev.digitaltraininglog.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ cert_arn       = "arn:aws:acm:us-east-1:465616206436:certificate/90aac4f1-04e9-4a19-b5ac-f3fb453f87f6" -> (known after apply)
  ~ cert_domain    = "dev.digitaltraininglog.com" -> "app.digitaltraininglog.com"
  + oac_id         = "E3VRQ2R2QNXB1G"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cappscr, Action: `pull_request`*